src/guix-config/binaries/bin/binaries.org
#+TITLE: Binaries
#+AUTHOR: Yusef Aslam
#+DESCRIPTION: Miscellaneous shell scripts.
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+PROPERTY: header-args :results output silent :mkdirp yes
#+STARTUP: overview

* Tangle this file
#+begin_src emacs-lisp
(org-babel-tangle)
#+end_src


* Display scripts
Scripts that relaunch things. Usually used for when a display is connected/disconnected.
** xlayout/post.sh
#+begin_src sh :tangle-mode (identity #o755)  :tangle xlayout/post.sh
#!/bin/sh

# pkill conky && conky -c ~/.config/conky/conky-moregap.conf && conky -c ~/.config/conky/conky-mpd.conf
# nitrogen --restore

# pkill stalonetray
# /usr/bin/stalonetray
pkill trayer
trayer --edge top --align right --SetDockType true --SetPartialStrut true --expand true --transparent false --height 17 --width 4 --alpha 0 --tint 0x000000 --transparent true &
# dzen2script.sh
# pkill dzen2
#+end_src

* Dmenu scripts
Dmenu scripts.
** dmenu-dark
#+begin_src sh :tangle-mode (identity #o755)  :tangle dmenu-dark
#!/bin/sh
source ${XDG_CONFIG_HOME:-$HOME/.config}/solarized/colors.ini
exec dmenu_run -nb $base03 -nf $base0 -sb $base02 -sf $orange -fn "DejaVu Sans Mono:size=16" "$@"
#+end_src

** dmenu-light
#+begin_src sh :tangle-mode (identity #o755)  :tangle dmenu-light
#!/bin/sh
source ${XDG_CONFIG_HOME:-$HOME/.config}/solarized/colors.ini
exec dmenu_run -nb $base3 -nf $base00 -sb $base2 -sf $orange -fn "DejaVu Sans Mono:size=16" "$@"
#+end_src

* Dotfile symlink scripts
Scripts to easily symlink/unsymlink packages in my dotfiles
** dotfl
#+begin_src sh :tangle-mode (identity #o755)  :tangle dotfl
#!/bin/bash

ARG="$1"
[[ -z $ARG ]] && echo "Needs argument!"
[[ ! -z $ARG ]] && stow -S $ARG -t "$HOME" -v
#+end_src

** dotfu
#+begin_src sh :tangle-mode (identity #o755)  :tangle dotfu
#!/bin/bash

ARG="$1"
[[ -z $ARG ]] && echo "Needs argument!"
[[ ! -z $ARG ]] && stow -D $ARG
#+end_src

* Dzen2 scripts
Scripts that use dzen2 to show various things.
** dzen2script-weather.sh
#+begin_src sh :tangle-mode (identity #o755)  :tangle dzen2script-weather.sh
#!/bin/sh

while true; do
    if [ ! -f /tmp/weather ]; then
        WEATHER="$(curl wttr.in/Turriff?0T | head -n8 > /tmp/weather)"
    fi
    if [ -f /tmp/weather ]; then
        cat /tmp/weather && sleep 2
        rm /tmp/weather
        echo -e "\n\n\n\n\n\n\n" >> /tmp/weather
    fi
done| dzen2 -u -l 8 -ta left -y 20 -fn "DejaVu Sans Mono:size=18:style=Bold" -w 300
#+end_src

** dzen2script-volbar.sh
#+begin_src sh :tangle-mode (identity #o755)  :tangle dzen2script-volbar.sh
#!/bin/sh

while true; do
   dbar-volume.sh
done | dzen2 -w 330 -ta left
#+end_src

** dzen2script-msgs.sh
#+begin_src sh :tangle-mode (identity #o755)  :tangle dzen2script-msgs.sh
#!/bin/sh

while true; do
    LOG="$(cat /var/log/messages | tail -n20 | sort -r)"
    echo "${LOG}" | perl -ne 'print "^fg(black) $_"'
    echo "^fg(lime)"
    sleep 20
done | dzen2 -u -ta left -bg aqua -x 580 -w 800 -l 20
#+end_src

** dzen2script.sh
#+begin_src sh :tangle-mode (identity #o755)  :tangle dzen2script.sh
#!/bin/bash

if [ ! -f "/tmp/dzen-is-lowered" ]; then
    touch /tmp/dzen-is-lowered
    DZENCMD="dzen2 -w 200 -e 'onstart=lower'"
else
    DZENCMD="dzen2 -w 200"
    rm /tmp/dzen-is-lowered
fi


while true; do
    STR_RIGHT="$(date)"
    RIGHTOFFSET="200"
    WINDOW=( $(xdpyinfo | awk -F ' |x' '/dimensions/ {print $7 " " $8}') )
    XPOS=$((-${WINDOW[0]} + $RIGHTOFFSET))
    echo "^p($XPOS)$STR_RIGHT"
    sleep 1
done | eval $DZENCMD
#+end_src

