src/guix-config/binaries/bin/binaries.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-14 Sat 18:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Binaries</title>
<meta name="author" content="Yusef Aslam" />
<meta name="description" content="Miscellaneous shell scripts." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Binaries</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc9fce85">1. Tangle this file</a></li>
<li><a href="#orgc715d47">2. Display scripts</a>
<ul>
<li><a href="#orgad72be3">2.1. xlayout/post.sh</a></li>
</ul>
</li>
<li><a href="#org65aa1c2">3. Dmenu scripts</a>
<ul>
<li><a href="#org5a784dd">3.1. dmenu-dark</a></li>
<li><a href="#org98294c2">3.2. dmenu-light</a></li>
</ul>
</li>
<li><a href="#orgdbc6069">4. Dotfile symlink scripts</a>
<ul>
<li><a href="#orge909a42">4.1. dotfl</a></li>
<li><a href="#orga741adf">4.2. dotfu</a></li>
</ul>
</li>
<li><a href="#orgc33066a">5. Dzen2 scripts</a>
<ul>
<li><a href="#org7ab858b">5.1. dzen2script-weather.sh</a></li>
<li><a href="#orge2a39c0">5.2. dzen2script-volbar.sh</a></li>
<li><a href="#org3a75959">5.3. dzen2script-msgs.sh</a></li>
<li><a href="#org2938dc1">5.4. dzen2script.sh</a></li>
<li><a href="#org53efc08">5.5. dvol</a></li>
<li><a href="#org57088e9">5.6. pulsevolbar.sh</a></li>
</ul>
</li>
<li><a href="#org228d452">6. Misc</a>
<ul>
<li><a href="#orgeb8ca25">6.1. xftheight</a></li>
<li><a href="#org8f99059">6.2. xftwidth</a></li>
<li><a href="#orgef1a844">6.3. emacsmail</a></li>
<li><a href="#org57c311e">6.4. kill-aw.sh</a></li>
<li><a href="#orgb257e82">6.5. unlock-gnome-keyring</a></li>
<li><a href="#orgee1952d">6.6. osc52.sh</a></li>
<li><a href="#orgf4e5dad">6.7. stumpish</a></li>
<li><a href="#org267196a">6.8. pacsize</a></li>
<li><a href="#org850a055">6.9. pastebin</a></li>
<li><a href="#org72321fc">6.10. poll</a></li>
<li><a href="#org04c2e7f">6.11. set-theme</a></li>
<li><a href="#org7a370e7">6.12. start-aw.sh</a></li>
<li><a href="#orgc019f07">6.13. start-keychain</a></li>
<li><a href="#org5b43d00">6.14. rain-sounds.sh</a></li>
<li><a href="#org5510518">6.15. import-settings</a></li>
</ul>
</li>
<li><a href="#org6b3ac73">7. Music control scripts</a>
<ul>
<li><a href="#orgc295936">7.1. mpc-control.sh</a></li>
</ul>
</li>
<li><a href="#org387a3e3">8. Status bar scripts</a>
<ul>
<li><a href="#org427b8bc">8.1. launch-bar.sh</a></li>
<li><a href="#org00e5558">8.2. launchdzenbar.sh</a></li>
</ul>
</li>
<li><a href="#orgdc4518a">9. Volume control scripts</a>
<ul>
<li><a href="#orgd7c532e">9.1. dbar-volume.sh</a></li>
<li><a href="#org48f5add">9.2. sndiovol.sh</a></li>
<li><a href="#org6e7b81c">9.3. sndiovolv2.sh</a></li>
<li><a href="#orgbba8126">9.4. sndiovolv2.sh.template</a></li>
</ul>
</li>
<li><a href="#orgbb1c293">10. Wayland scripts</a>
<ul>
<li><a href="#orge8602bf">10.1. wlprop</a></li>
</ul>
</li>
<li><a href="#org725a35a">11. Startup scripts</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc9fce85" class="outline-2">
<h2 id="orgc9fce85"><span class="section-number-2">1.</span> Tangle this file</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(org-babel-tangle)
</pre>
</div>
</div>
</div>


<div id="outline-container-orgc715d47" class="outline-2">
<h2 id="orgc715d47"><span class="section-number-2">2.</span> Display scripts</h2>
<div class="outline-text-2" id="text-2">
<p>
Scripts that relaunch things. Usually used for when a display is connected/disconnected.
</p>
</div>
<div id="outline-container-orgad72be3" class="outline-3">
<h3 id="orgad72be3"><span class="section-number-3">2.1.</span> xlayout/post.sh</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh

# pkill conky &amp;&amp; conky -c ~/.config/conky/conky-moregap.conf &amp;&amp; conky -c ~/.config/conky/conky-mpd.conf
# nitrogen --restore

# pkill stalonetray
# /usr/bin/stalonetray
pkill trayer
trayer --edge top --align right --SetDockType true --SetPartialStrut true --expand true --transparent false --height 17 --width 4 --alpha 0 --tint 0x000000 --transparent true &amp;
# dzen2script.sh
# pkill dzen2
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org65aa1c2" class="outline-2">
<h2 id="org65aa1c2"><span class="section-number-2">3.</span> Dmenu scripts</h2>
<div class="outline-text-2" id="text-3">
<p>
Dmenu scripts.
</p>
</div>
<div id="outline-container-org5a784dd" class="outline-3">
<h3 id="org5a784dd"><span class="section-number-3">3.1.</span> dmenu-dark</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh
source ${XDG_CONFIG_HOME:-$HOME/.config}/solarized/colors.ini
exec dmenu_run -nb $base03 -nf $base0 -sb $base02 -sf $orange -fn "DejaVu Sans Mono:size=16" "$@"
</pre>
</div>
</div>
</div>

<div id="outline-container-org98294c2" class="outline-3">
<h3 id="org98294c2"><span class="section-number-3">3.2.</span> dmenu-light</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh
source ${XDG_CONFIG_HOME:-$HOME/.config}/solarized/colors.ini
exec dmenu_run -nb $base3 -nf $base00 -sb $base2 -sf $orange -fn "DejaVu Sans Mono:size=16" "$@"
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdbc6069" class="outline-2">
<h2 id="orgdbc6069"><span class="section-number-2">4.</span> Dotfile symlink scripts</h2>
<div class="outline-text-2" id="text-4">
<p>
Scripts to easily symlink/unsymlink packages in my dotfiles
</p>
</div>
<div id="outline-container-orge909a42" class="outline-3">
<h3 id="orge909a42"><span class="section-number-3">4.1.</span> dotfl</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-sh">#!/bin/bash

ARG="$1"
[[ -z $ARG ]] &amp;&amp; echo "Needs argument!"
[[ ! -z $ARG ]] &amp;&amp; stow -S $ARG -t "$HOME" -v
</pre>
</div>
</div>
</div>

<div id="outline-container-orga741adf" class="outline-3">
<h3 id="orga741adf"><span class="section-number-3">4.2.</span> dotfu</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-sh">#!/bin/bash

ARG="$1"
[[ -z $ARG ]] &amp;&amp; echo "Needs argument!"
[[ ! -z $ARG ]] &amp;&amp; stow -D $ARG
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc33066a" class="outline-2">
<h2 id="orgc33066a"><span class="section-number-2">5.</span> Dzen2 scripts</h2>
<div class="outline-text-2" id="text-5">
<p>
Scripts that use dzen2 to show various things.
</p>
</div>
<div id="outline-container-org7ab858b" class="outline-3">
<h3 id="org7ab858b"><span class="section-number-3">5.1.</span> dzen2script-weather.sh</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh

while true; do
    if [ ! -f /tmp/weather ]; then
	WEATHER="$(curl wttr.in/Turriff?0T | head -n8 &gt; /tmp/weather)"
    fi
    if [ -f /tmp/weather ]; then
	cat /tmp/weather &amp;&amp; sleep 2
	rm /tmp/weather
	echo -e "\n\n\n\n\n\n\n" &gt;&gt; /tmp/weather
    fi
done| dzen2 -u -l 8 -ta left -y 20 -fn "DejaVu Sans Mono:size=18:style=Bold" -w 300
</pre>
</div>
</div>
</div>

<div id="outline-container-orge2a39c0" class="outline-3">
<h3 id="orge2a39c0"><span class="section-number-3">5.2.</span> dzen2script-volbar.sh</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh

while true; do
   dbar-volume.sh
done | dzen2 -w 330 -ta left
</pre>
</div>
</div>
</div>

<div id="outline-container-org3a75959" class="outline-3">
<h3 id="org3a75959"><span class="section-number-3">5.3.</span> dzen2script-msgs.sh</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh

while true; do
    LOG="$(cat /var/log/messages | tail -n20 | sort -r)"
    echo "${LOG}" | perl -ne 'print "^fg(black) $_"'
    echo "^fg(lime)"
    sleep 20
done | dzen2 -u -ta left -bg aqua -x 580 -w 800 -l 20
</pre>
</div>
</div>
</div>

<div id="outline-container-org2938dc1" class="outline-3">
<h3 id="org2938dc1"><span class="section-number-3">5.4.</span> dzen2script.sh</h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">
<pre class="src src-sh">#!/bin/bash

if [ ! -f "/tmp/dzen-is-lowered" ]; then
    touch /tmp/dzen-is-lowered
    DZENCMD="dzen2 -w 200 -e 'onstart=lower'"
else
    DZENCMD="dzen2 -w 200"
    rm /tmp/dzen-is-lowered
fi


while true; do
    STR_RIGHT="$(date)"
    RIGHTOFFSET="200"
    WINDOW=( $(xdpyinfo | awk -F ' |x' '/dimensions/ {print $7 " " $8}') )
    XPOS=$((-${WINDOW[0]} + $RIGHTOFFSET))
    echo "^p($XPOS)$STR_RIGHT"
    sleep 1
done | eval $DZENCMD
</pre>
</div>
</div>
</div>
