src/guix-config/binaries/bin/binaries.org
** dvol
#+begin_src sh :tangle-mode (identity #o755)  :tangle dvol
  #!/usr/bin/env bash

  #Customize this stuff
  IF="Master"
  SECS="2"

  BG="#000000"
  FG="green"
  WIDTH="250"
  WIDTH_BAR=$(($WIDTH - 150))
  WINDOW=( $(xdpyinfo | awk -F ' |x' '/dimensions/ {print $7 " " $8}') )
  XPOS=$(((${WINDOW[0]} / 2) - ($WIDTH / 2)))
  YPOS=$((${WINDOW[1]} / 2))

  ICON_VOL=~/Git/sm4tik-xbm-icons/icons/spkr_01.xbm
  ICON_VOL_MUTE=~/Git/sm4tik-xbm-icons/icons/spkr_02.xbm
  ICON=$ICON_VOL

  #Probably do not customize
  PIPE="/tmp/dvolpipe"

  err() {
    echo "$1"
    exit 1
  }

  usage() {
    echo "usage: dvol [option] [argument] [interface]"
    echo
    echo "Options:"
    echo "     -i, --increase - increase volume by \`argument'"
    echo "     -d, --decrease - decrease volume by \`argument'"
    echo "     -t, --toggle   - toggle mute on and off"
    echo "     -h, --help     - display this"
    echo
    echo "The interface could be specified by the interface"
    echo "parameter. If it is not specified, the IF var will be"
    echo "used."
    exit
  }

  #Argument Parsing
  case "$1" in
    '-i'|'--increase')
      [ -z "$2" ] && err "No argument specified for increase."
      [ -n "$(tr -d [0-9] <<<$2)" ] && err "The argument needs to be an integer."
      AMIXARG="${2}%+"
      ;;
    '-d'|'--decrease')
      [ -z "$2" ] && err "No argument specified for decrease."
      [ -n "$(tr -d [0-9] <<<$2)" ] && err "The argument needs to be an integer."
      AMIXARG="${2}%-"
      ;;
    '-t'|'--toggle')
      AMIXARG="toggle"
      ;;
    ''|'-h'|'--help')
      usage
      ;;
    ,*)
      err "Unrecognized option \`$1', see dvol --help"
      ;;
  esac

  # Optional interface parameter:
  if [ $AMIXARG == "toggle" ]; then
      IF=${2:-$IF}
  else
      IF=${3:-$IF}
  fi


  #Actual volume changing (readability low)
  AMIXOUT="$(amixer set "$IF" "$AMIXARG" | tail -n 1)"
  MUTE="$(cut -d '[' -f 3 <<<"$AMIXOUT")"
  if [ "$MUTE" = "off]" ]; then
    ICON=$ICON_VOL_MUTE
  else
    ICON=$ICON_VOL
  fi

  VOL="$(cut -d '[' -f 2 <<<"$AMIXOUT" | sed 's/%.*//g')"

  #Using named pipe to determine whether previous call still exists
  #Also prevents multiple volume bar instances
  if [ ! -e "$PIPE" ]; then
    mkfifo "$PIPE"
    (dzen2 -tw $WIDTH -x "$XPOS" -y "$YPOS" -w "$WIDTH" -bg "$BG" -fg "$FG" < "$PIPE"; rm -f "$PIPE") &
  fi

  #Feed the pipe!
  (echo "$VOL" | /usr/local/bin/dzen2-gdbar -l "$IF ^i(${ICON}) " -fg "$FG" -bg "$BG" -w $WIDTH_BAR ; sleep "$SECS") > "$PIPE"
#+end_src

** pulsevolbar.sh
#+begin_src sh :tangle-mode (identity #o755)  :tangle pulsevolbar.sh
#!/bin/bash
#
# filename: pulsevolbar.sh
# Usage:
#      pulsevolbar.sh <increase/decrease/mute>
#
#
#Customize this stuff
SECS="1"            # sleep $SECS
BG="#8E35EF"        # background colour of window
FG="#FFFF00"        # foreground colour of text/icon
BAR_FG="#F52887"    # foreground colour of volume bar
BAR_BG="#41A317"    # background colour of volume bar
HEIGHT="30"         # window height
WIDTH="250"         # window width
BAR_WIDTH="150"     # width of volume bar
ICON=~/.pulse/dzen_icons/vol-hi.xbm
FONT="-*-terminus-medium-r-*-*-14-*-*-*-*-*-*-*"
ICON_VOL=~/.icons/dzen_icons/vol-hi.xbm
ICON_VOL_MUTE=~/.icons/dzen_icons/vol-mute.xbm
ICON=$ICON_VOL
PULSE_MAX_VOL=65536

# No need to customize this variable
PIPE="/tmp/pulesvolpipe"

# Lets find the appropriate positioning for the volume bar
XRES=`xdpyinfo|grep 'dimensions:'|awk '{print $2}'|cut -dx -f1`
XPOS=$[$XRES / 2 - $WIDTH / 2]          # horizontal positioning
YRES=`xdpyinfo|grep 'dimensions:'|awk '{print $2}'|cut -dx -f2`
YPOS=$[$YRES * 4 / 5]          # vertical positioning

# Sets the desired volume
function set_volume()
{
	CURVOL=$1
	pactl set-sink-volume 0 $CURVOL
}

# Gets the current volume
function get_volume()
{
    MIXER=$(pacmd list-sinks 0 | grep -i "volume: 0:")
    echo $MIXER | cut -d ' ' -f 3 | cut -d '%' -f 1
}

# Get muted ? returns yes or no
function get_muted()
{
    MUTED=$(pacmd list-sinks 0 | grep muted | cut -d ' ' -f 2)
    echo $MUTED
}

VOL=$(get_volume)
CURVOL=$[$VOL * $PULSE_MAX_VOL / 100 ]
MUTE=$(get_muted)         # Reads mute state
if [[ $MUTE == "yes" ]]	# Sets the icon to mute_icon as the increase or decrease will not make speaker speak
then
    ICON=$ICON_VOL_MUTE
fi

if [[ $1 == "increase" ]]
then
    CURVOL=$(($CURVOL + 3277))	# 3277 is 5% of the total volume, you can change this to suit your needs.
    if [[ $CURVOL -ge $PULSE_MAX_VOL ]]
    then
        CURVOL=$PULSE_MAX_VOL
    fi
    set_volume $CURVOL
elif [[ $1 == "decrease" ]]
then
    CURVOL=$(($CURVOL - 3277))
    if [[ $CURVOL -le 0 ]]
    then
        CURVOL=0
    fi
    set_volume $CURVOL
elif [[ $1 == "mute" ]]
then
    if [[ $MUTE == "no" ]]
    then
        pactl set-sink-mute 0 1
	ICON=$ICON_VOL_MUTE
    else
        pactl set-sink-mute 0 0
	ICON=$ICON_VOL
    fi
fi

# showing in dzen2
if [ ! -e "$PIPE" ];
# if pipe file does not exists
then
	mkfifo "$PIPE"
	(dzen2 -tw "$WIDTH" -h "$HEIGHT" -x "$XPOS" -y "$YPOS" -fn "$FONT" -bg "$BG" -fg "$FG" < "$PIPE"
	rm  -f "$PIPE") &
fi
# feed the pipe
(echo $[$CURVOL *  100 / $PULSE_MAX_VOL]| gdbar -l "^i(${ICON})" -fg "$BAR_FG" -bg "$BAR_BG" -w "$BAR_WIDTH"  ; sleep "$SECS" ) > "$PIPE"
#+end_src

* Misc
Miscellaneous scripts.
** xftheight
#+begin_src so-long :tangle xftheight
ELF
#+end_src

** xftwidth
#+begin_src so-long :tangle xftwidth
ELF
#+end_src

** emacsmail
#+begin_src sh :tangle-mode (identity #o755)  :tangle emacsmail
emacsclient -create-frame -n --alternate-editor='emacs' --no-wait --eval \
"(progn (x-focus-frame nil) (mu4e-compose-from-mailto \"$1\" t))"
#+end_src

** kill-aw.sh
#+begin_src sh :tangle-mode (identity #o755)  :tangle kill-aw.sh
#!/bin/bash
# Kill activitywatcher
pkill aw-
notify-send "ActivityWatch killed"
#+end_src

** unlock-gnome-keyring
#+begin_src sh :tangle-mode (identity #o755)  :tangle unlock-gnome-keyring
#!/bin/bash

echo 'NOTE: This script will only work if launched via source or .' >&2
echo -n 'Login password: ' >&2
read -s _UNLOCK_PASSWORD || return
killall -q -u "$(whoami)" gnome-keyring-daemon
eval $(echo -n "${_UNLOCK_PASSWORD}" \
           | gnome-keyring-daemon --daemonize --login \
           | sed -e 's/^/export /')
unset _UNLOCK_PASSWORD
echo '' >&2
#+end_src

