src/guix-config/binaries/bin/binaries.html

<div id="outline-container-orgee1952d" class="outline-3">
<h3 id="orgee1952d"><span class="section-number-3">6.6.</span> osc52.sh</h3>
<div class="outline-text-3" id="text-6-6">
<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh
# Copyright (c) 2012 The Chromium OS Authors. All rights reserved.
# Use of this source code is governed by a BSD-style license that can be
# found in the LICENSE file.
# Max length of the OSC 52 sequence.  Sequences longer than this will not be
# sent to the terminal.
OSC_52_MAX_SEQUENCE="100000"
# Write an error message and exit.
# Usage: &lt;message&gt;
die() {
  echo "ERROR: $*"
  exit 1
}
# Send a DCS sequence through tmux.
# Usage: &lt;sequence&gt;
tmux_dcs() {
  printf '\033Ptmux;\033%s\033\\' "$1"
}
# Send a DCS sequence through screen.
# Usage: &lt;sequence&gt;
screen_dcs() {
  # Screen limits the length of string sequences, so we have to break it up.
  # Going by the screen history:
  #   (v4.2.1) Apr 2014 - today: 768 bytes
  #   Aug 2008 - Apr 2014 (v4.2.0): 512 bytes
  #   ??? - Aug 2008 (v4.0.3): 256 bytes
  # Since v4.2.0 is only ~4 years old, we'll use the 256 limit.
  # We can probably switch to the 768 limit in 2022.
  local limit=256
  # We go 4 bytes under the limit because we're going to insert two bytes
  # before (\eP) and 2 bytes after (\e\) each string.
  echo "$1" | \
    sed -E "s:.{$(( limit - 4 ))}:&amp;\n:g" | \
    sed -E -e 's:^:\x1bP:' -e 's:$:\x1b\\:' | \
    tr -d '\n'
}
# Send an escape sequence to hterm.
# Usage: &lt;sequence&gt;
print_seq() {
  local seq="$1"
  case ${TERM-} in
  screen*)
    # Since tmux defaults to setting TERM=screen (ugh), we need to detect
    # it here specially.
    if [ -n "${TMUX-}" ]; then
      tmux_dcs "${seq}"
    else
      screen_dcs "${seq}"
    fi
    ;;
  tmux*)
    tmux_dcs "${seq}"
    ;;
  *)
    echo "${seq}"
    ;;
  esac
}
# Base64 encode stdin.
b64enc() {
  base64 | tr -d '\n'
}
# Send the OSC 52 sequence to copy the content.
# Usage: [string]
copy() {
  local str
  if [ $# -eq 0 ]; then
    str="$(b64enc)"
  else
    str="$(echo "$@" | b64enc)"
  fi
  if [ ${OSC_52_MAX_SEQUENCE} -gt 0 ]; then
    local len=${#str}
    if [ ${len} -gt ${OSC_52_MAX_SEQUENCE} ]; then
      die "selection too long to send to terminal:" \
	"${OSC_52_MAX_SEQUENCE} limit, ${len} attempted"
    fi
  fi
  print_seq "$(printf '\033]52;c;%s\a' "${str}")"
}
# Write tool usage and exit.
# Usage: [error message]
usage() {
  if [ $# -gt 0 ]; then
    exec 1&gt;&amp;2
  fi
  cat &lt;&lt;EOF
Usage: osc52 [options] [string]
Send an arbitrary string to the terminal clipboard using the OSC 52 escape
sequence as specified in xterm:
  https://invisible-island.net/xterm/ctlseqs/ctlseqs.html
  Section "Operating System Controls", Ps =&gt; 52.
The data can either be read from stdin:
  $ echo "hello world" | osc52.sh
Or specified on the command line:
  $ osc52.sh "hello world"
Options:
  -h, --help    This screen.
  -f, --force   Ignore max byte limit (${OSC_52_MAX_SEQUENCE})
EOF
  if [ $# -gt 0 ]; then
    echo
    die "$@"
  else
    exit 0
  fi
}
main() {
  set -e
  while [ $# -gt 0 ]; do
    case $1 in
    -h|--help)
      usage
      ;;
    -f|--force)
      OSC_52_MAX_SEQUENCE=0
      ;;
    -*)
      usage "Unknown option: $1"
      ;;
    *)
      break
      ;;
    esac
    shift
  done
  copy "$@"
}
main "$@"
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf4e5dad" class="outline-3">
<h3 id="orgf4e5dad"><span class="section-number-3">6.7.</span> stumpish</h3>
<div class="outline-text-3" id="text-6-7">
<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh

# Copyright (C) 2007 Jonathan Moore Liles
#
# Maintainer: Jonathan Moore Liles
#
# stumpish is free software; you can redistribute it and/or modify
# it under the terms of the GNU General Public License as published by
# the Free Software Foundation; either version 2, or (at your option)
# any later version.
#
# stumpish is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
# GNU General Public License for more details.
#
# You should have received a copy of the GNU General Public License
# along with this software; see the file COPYING.  If not, see
# &lt;http://www.gnu.org/licenses/&gt;.

### STUMPwm Interactive SHell.

DELAY=0.01

if ! sleep $DELAY 2&gt;/dev/null &gt;&amp;2
then
    DELAY=1
fi

# replace -E with -r option for old versions of GNU sed
if ! sed -E 1p /dev/null 2&gt;/dev/null; then
    sed() { shift; command sed -r "$@"; }
fi

# parse C-style backslash sequences by default
if [ "$(echo -e foo)" = foo ]; then
    echo() { builtin echo -e "$@"; }
fi

wait_result ()
{
    while true
    do
	RESULT=$(xprop -root -f STUMPWM_COMMAND_RESULT 8s \
	    STUMPWM_COMMAND_RESULT 2&gt;/dev/null |
	    sed -E 's/\\([[:digit:]]+)/\\0\1/g')
	if echo "$RESULT" | grep -v -q 'not found.$'
	then
	    break
	fi

	sleep $DELAY
    done

    xprop -root -remove STUMPWM_COMMAND_RESULT

    if echo "$RESULT" | grep -q '= $'
    then
	return 0
    fi

    echo "$RESULT" |
    sed -E 's/[^"\\n]+"//
	    /^"[[:space:]]*$/d
	    s/(^|[^\\])\\n/\1\
/g
	    s/\\(["\\n])/\1/g
	    s/\^([*[:digit:]]+|[Bbn])//g'
}

send_cmd ()
{
    local cmd="$1"

    if [ "$cmd" = "stumpwm-quit" ]
    then
	cmd=quit
    elif [ "$cmd" = "quit" ]
    then
	exit
    fi

    xprop -root -f STUMPWM_COMMAND 8s -set STUMPWM_COMMAND "$cmd"

    wait_result
}

usage ()
{
    cat &lt;&lt;EOF
Usage: ${0##*/} [[-e|-r] command [args...]]

StumpIsh is the StumpWM shell. Use it to interact a running StumpWM
instance.  When run from a terminal with no arguments, stumpish
accepts commands interactively and prints each result.  If standard
input is a pipe, stumpish executes any number of commands and prints
the concatenated results. If the '-e' option and one argument are
given on the command line, stumpish reads any number of lines from
standard input and uses them as the argument to the named command.
Otherwise, if one or more arguments are provided on the command line,
the first is considered the name of the command to execute and the
remainder is concatenated to form the argument.

Example:
	echo '(group-windows (current-group))' | ${0##*/} -e eval
EOF
    exit 0;
}

warn ()
{
  {
    tput md bold
    tput AF setaf 1
    echo 'WARN:\c'
    tput me sgr0
    echo " $*"
  } &gt;&amp;2
}

tput ()
{
    local cap1=$1 cap2=$2
    shift 2

    command tput $cap1 $@ 2&gt;/dev/null ||
    command tput $cap2 $@ 2&gt;/dev/null
}

READLINE=yes

if [ "x$1" = "x-r" ]
then
    READLINE=no
    shift 1
fi

if [ $# -gt 0 ]
then
    [ "$1" = "--help" ] &amp;&amp; usage
    if [ "$1" = "-e" ]
    then
	if [ $# -ne 2 ]
	then
	    echo "'-e' requires exactly one argument!"
	    exit
	fi
	shift 1
	IFS=''
	ARGS=$(cat /dev/stdin)
	send_cmd "$1 $ARGS"
    else
	IFS=' '
	send_cmd "$*"
    fi
else
    if [ -t 0 ]
    then
	if ! type rlwrap 2&gt;/dev/null &gt;&amp;2
	then
	    warn rlwrap not found, command completion won\'t work
	elif [ $READLINE = yes ]
	then
	    COMMANDS="${TMPDIR:-/tmp}/stumpish.commands.$$"
	    echo $(send_cmd "commands") |
	    sed -E 's/[[:space:]]+/\
/g' |
	    sort &gt; "$COMMANDS"
	    trap 'rm -f "$COMMANDS"' exit int term
	    rlwrap -b '' -f "$COMMANDS" "$0" -r
	    exit
	fi

	tput AF setaf 5
	echo Welcome to the STUMPwm Interactive SHell.
	tput me sgr0
	echo 'Type \c'
	tput AF setaf 2
	echo 'commands\c'
	tput me sgr0
	echo \ for a list of commands.

	while read -p '&gt; ' REPLY
	do
	    tput md bold
	    tput AF setaf 2
	    send_cmd "$REPLY"
	    tput me sgr0
	done
    else
	while read REPLY
	do
	    send_cmd "$REPLY"
	done
    fi
fi
</pre>
</div>
</div>
</div>
