src/guix-config/binaries/bin/binaries.org
** pacsize
#+begin_src python :tangle pacsize
#!/usr/bin/env python
import re
import os

class Package:
    def __init__(self,name,size):
        self.name = name
        self.size = int(round(float(size)))
    def __repr__(self):
        return `self.size`+" "+self.name
    def __cmp__(self,other):
        return cmp(other.size,self.size) #desc

paclist = []

re_name = re.compile(r'Name\s*:\s*(\S+)')
re_size = re.compile(r'Installed Size\s*:\s*([0-9.]+).*')

p = os.popen("pacman -Qi","r")

for line in p.readlines():
    match_name = re_name.match(line)
    match_size = re_size.match(line)
    if match_name :
            package_name = match_name.groups(1)[0]
    if match_size :
            package_size = match_size.groups(1)[0]
            paclist.append(Package(package_name,package_size))

p.close()

paclist.sort()
for pac in paclist: print pac
#+end_src

** pastebin
#+begin_src sh :tangle-mode (identity #o755)  :tangle pastebin
#!/bin/bash

arg1="$1"
cat $arg1 | curl -F 'f:1=<-' ix.io
#+end_src

** poll
#+begin_src sh :tangle-mode (identity #o755)  :tangle poll
#!/usr/bin/env bash

__ScriptVersion="0.2"

sha=0
previous_sha=0
timeout=1
lazy=false
all=false
sha_cmd=shasum
execute_on_startup=false

#===  FUNCTION  ================================================================
#         NAME:  execute_command
#  DESCRIPTION:  Execute the command giveng in the command line argument.
#===============================================================================
function execute_command() {
	clear
	echo -en "executing \`${cmd}.\`\n"
	echo -en "----------------------------------------------------------------"
	echo -en "\n\n"
	eval "${cmd}"
	echo -en "\n\n"
	echo -en "----------------------------------------------------------------"
	echo -en "\ndone. Waiting for new changes on $path"
}

#===  FUNCTION  ================================================================
#         NAME:  update_sha
#  DESCRIPTION:  Updates the global sha varialbe by calculating the hash of the
#                path using the specified sha_cmd.
#===============================================================================
function update_sha() {
	if [[ $all == true ]]; then
		sha=$(find "$path" -type f \
			| sort -z | xargs $sha_cmd 2> /dev/null | $sha_cmd)
	else
		sha=$(find "$path" -type f -not -path '*/\.*' \
			| sort -z | xargs $sha_cmd 2> /dev/null | $sha_cmd)
	fi
}

#===  FUNCTION  ================================================================
#         NAME:  usage
#  DESCRIPTION:  Display usage information.
#===============================================================================
function usage () {
				cat <<- EOT
         ___   ____
        /   / /   / /    /
       /___/ /   / /    /
      /     /   / /    /
     /     /___/ /___ /___

  Polls a file or directory content and executes a given command if a change
  has occurred. Uses a hash of the content for comparison.

  Usage :  $0 [options] /path/to/observe command_to_execute_on_change

  Options:
  -a|all        Include hidden files in obervation.
	-e|startup    Execute command on startup
  -h|help       Display this message.
  -l|lazy       Don't react to changes that happen during execution of the
                command. Usefull if	the command changes the oberved to path.
  -s|sha        Set the command used to calculate hash. The default is shasum.
  -t|timeout    Set the time to sleep between looking for changes.
  -v|version    Display script version.

  Example : $0 -l -s shasum5.18 -t 0.5 /tmp/ 'echo change detected at \`date\`'

				EOT
}

#-------------------------------------------------------------------------------
#  Handle command line arguments
#-------------------------------------------------------------------------------
while getopts "aet:ls:hv" opt
do
  case $opt in
		a|all      )  all=true                                        ;;
		e|startup  )  execute_on_startup=true                         ;;
		h|help     )  usage; exit 0                                   ;;
		l|lazy     )  lazy=true                                       ;;
		s|sha      )  sha_cmd=$OPTARG;                                ;;
		t|timeout  )  timeout=$OPTARG;                                ;;
		v|version  )  echo "$0 -- Version $__ScriptVersion"; exit 0   ;;

		\? )  echo -e "\n  Option does not exist : $OPTARG\n"
				  usage; exit 1                                       ;;

  esac    # --- end of case ---
done
shift $((OPTIND-1))

#-------------------------------------------------------------------------------
#  Main script
#-------------------------------------------------------------------------------
if [ $# -eq 0 ];
then
	usage
    exit 0
fi
path=$1
shift
cmd=$*
update_sha
previous_sha=$sha
echo -en "Observing $path and will execute \`$cmd\`"
if [[ $execute_on_startup == true ]]; then
	execute_command
fi
while true; do
	if [[ "$sha" != "$previous_sha" ]]; then
		execute_command
		previous_sha=$sha
		if [[ $lazy == true ]]; then
			update_sha
			previous_sha=$sha
			continue
		fi
	fi
	update_sha
	sleep "$timeout"
done
#+end_src

** set-theme
#+begin_src sh :tangle-mode (identity #o755)  :tangle set-theme
#!/bin/sh
# Set theme for desktop using gsettings.
# This file is autostarted from desktop file "$HOME/.config/autostart/set-theme.desktop".
# I made this so that when using a Tiling WM etc.. the theme adjustments will be reset to ones for GNOME when launching GNOME.
# This is why we also check $XDG_CURRENT_DESKTOP so if we use another DE, we don't change it's customized theme to something else.

# Check if the current desktop is GNOME, if so, set correct theme.
if [ "$XDG_CURRENT_DESKTOP" == "GNOME" ]; then
    GNOME_SCHEMA="org.gnome.desktop.interface"
    gsettings set $GNOME_SCHEMA gtk-theme "Adwaita"
    gsettings set $GNOME_SCHEMA icon-theme "Adwaita"
    gsettings set $GNOME_SCHEMA font-name "Cantarell 12"
    gsettings set $GNOME_SCHEMA cursor-theme "Adwaita"
fi

# Check if the current desktop is Hyprland, if so, set correct theme.
if [ "$XDG_CURRENT_DESKTOP" == "Hyprland" ]; then
    GNOME_SCHEMA="org.gnome.desktop.interface"
    gsettings set $GNOME_SCHEMA gtk-theme "Greybird-dark"
    gsettings set $GNOME_SCHEMA icon-theme "Adwaita"
    gsettings set $GNOME_SCHEMA font-name "Fira Sans 12"
    gsettings set $GNOME_SCHEMA cursor-theme "elementary"
fi
#+end_src

** start-aw.sh
#+begin_src sh :tangle-mode (identity #o755)  :tangle start-aw.sh
#!/bin/bash
# Start activitywatcher

cd ~/.local/opt/activitywatch

pkill aw-

yszKillAwServer=$(pgrep aw -a | grep "server" | awk '{print $1}')
yszKillWindowWatcher=$(pgrep aw -a | grep "window" | awk '{print $1}')
yszKillAfkWatcher=$(pgrep aw -a | grep "afk" | awk '{print $1}')

aw-server &
aw-watcher-utilization &

if [[ "$XDG_CURRENT_DESKTOP" == "GNOME" ]]
then
    ${yszKillWindowWatcher}
    ${yszKillAfkWatcher}
    aw-watcher-gnome &
    if [[ "$XDG_SESSION_TYPE" != "wayland" ]]
    then
        [[ $(pgrep aw-server) ]] && aw-watcher-afk &
        [[ $(pgrep aw-server) ]] && aw-watcher-window &
    fi
fi

if [[ "$XDG_SESSION_TYPE" == "wayland" && "$XDG_CURRENT_DESKTOP" != "GNOME" ]]
then
    ${yszKillWindowWatcher}
    ${yszKillAfkWatcher}
    aw-watcher-wayland &
else
    [[ $(pgrep aw-server) ]] && aw-watcher-afk &
    [[ $(pgrep aw-server) ]] && aw-watcher-window &
fi

notify-send "ActivityWatch started"
#+end_src

