src/guix-config/binaries/bin/binaries.org
** start-keychain
#+begin_src sh :tangle-mode (identity #o755)  :tangle start-keychain
#!/bin/sh

eval $(keychain --eval --noask --quiet id_ed25519)
#+end_src

** rain-sounds.sh
#+begin_src sh :tangle-mode (identity #o755)  :tangle rain-sounds.sh
#!/bin/bash

chromium --new-window https://www.youtube.com/watch?v=SEkPsIXQEIU &


qpwgraph -a $HOME/Documents/qpwgraph-patchbays/dual-output-rain-sounds.qpwgraph &
pavucontrol &

#+end_src

** import-settings
Set cursor theme e.g for use with Hyprland or any other window manager that runs on Wayland.
#+begin_src sh :tangle-mode (identity #o755)  :tangle import-settings
#!/bin/sh

# usage: import-gsettings
config="${XDG_CONFIG_HOME:-$HOME/.config}/gtk-3.0/settings.ini"
if [ ! -f "$config" ]; then exit 1; fi

gnome_schema="org.gnome.desktop.interface"
gtk_theme="$(grep 'gtk-theme-name' "$config" | sed 's/.*\s*=\s*//')"
icon_theme="$(grep 'gtk-icon-theme-name' "$config" | sed 's/.*\s*=\s*//')"
cursor_theme="$(grep 'gtk-cursor-theme-name' "$config" | sed 's/.*\s*=\s*//')"
font_name="$(grep 'gtk-font-name' "$config" | sed 's/.*\s*=\s*//')"
gsettings set "$gnome_schema" gtk-theme "$gtk_theme"
gsettings set "$gnome_schema" icon-theme "$icon_theme"
gsettings set "$gnome_schema" cursor-theme "$cursor_theme"
gsettings set "$gnome_schema" font-name "$font_name"
#+end_src
* Music control scripts
** mpc-control.sh
#+begin_src sh :tangle-mode (identity #o755)  :tangle mpc-control.sh
#!/bin/sh
#

PAUSECMD=$(mpc | egrep '(paused|playing)' | awk '{print $1}' | sed 's/\[//g;s/\]//g')
ARG="$1"

case "$ARG" in
    "PAUSE" )
        echo "${PAUSECMD}" > /tmp/mpcpausedstate
        if [[ "$(cat /tmp/mpcpausedstate)" == "paused" ]]; then
            mpc play
        fi
        if [[ "$(cat /tmp/mpcpausedstate)" == "playing" ]]; then
            mpc pause
        fi
        ;;
    "STOP" )
        mpc stop
        ;;
    "NEXT" )
        mpc next
        ;;
    "PREVIOUS" )
        mpc prev
        ;;
    "STATUS" )
        mpc | head -n2 | tr '\n' ' '
        ;;
esac
#+end_src

* Status bar scripts
** launch-bar.sh
#+begin_src sh :tangle-mode (identity #o755)  :tangle launch-bar.sh
#!/bin/sh

oxbar -F $HOME/.config/oxbar/oxbar.conf mytheme
#+end_src

** launchdzenbar.sh
#+begin_src sh :tangle-mode (identity #o755)  :tangle launchdzenbar.sh
#!/bin/sh

dzen2script.sh
sleep 1
dzen2script-msgs.sh
sleep 1
dzen2script-volbar.sh
# sleep 1
# dzen2script-weather.sh &
#+end_src

* Volume control scripts
Scripts to control volume.
** dbar-volume.sh
#+begin_src sh :tangle-mode (identity #o755)  :tangle dbar-volume.sh
#!/bin/sh

VOLUME="$(sndiovolv2.sh STATUS | xargs printf %.0f)"

echo ${VOLUME} | dbar -max 100 -min 0 -s '#' -l 'Vol'
#+end_src

** sndiovol.sh
#+begin_src sh :tangle-mode (identity #o755)  :tangle sndiovol.sh
#!/bin/sh

VOLCMD=$(sndioctl | grep output.level | sed 's/output\.level\=//g')
VOL=$(echo "${VOLCMD}*100" | bc)
ADJ="$1"
VOLADJ="$2"

if [[ -z $VOLADJ ]]; then
    UP=3
    DOWN=3
else
    UP=$VOLADJ
    DOWN=$VOLADJ
fi

VOLUP=$(echo "(${VOL}+$UP)/100" | bc -l)
VOLDOWN=$(echo "(${VOL}-$DOWN)/100" | bc -l)

if [[ "$ADJ" == "UP" ]]; then
    sndioctl output.level=+${VOLUP}
fi

if [[ "$ADJ" == "DOWN" ]]; then
    sndioctl output.level=-${VOLDOWN}
fi

if [[ "$ADJ" == "STATUS" ]]; then
    echo "${VOL}"
fi

MUTESTATUS=$(echo "(${VOL}/100)>0" | bc -l)

if [[ "$ADJ" == "TOGMUTE" ]]; then
    if [[ ${MUTESTATUS} -eq 1 ]]; then
        CURVOL=$(echo $(echo "${VOL}/100" | bc -l) > /tmp/curvol)
        sndioctl output.level=0
    fi
    if [[ ${MUTESTATUS} -eq 0 ]]; then
        CURVOL=$(cat /tmp/curvol)
        sndioctl output.level=${CURVOL}
    fi
fi
#+end_src

** sndiovolv2.sh
#+begin_src sh :tangle-mode (identity #o755)  :tangle sndiovolv2.sh
#!/usr/local/bin/bash

VOL_CMD=$(sndioctl output.level | cut -d'=' -f2)
ARG[1]=$1
if [ ! -z $2 ]; then
    ARG[2]=$(bc -l <<< "$2/100" | xargs printf %.2f)
fi

case ${ARG[1]} in
    "STATUS")
        bc -l <<< "${VOL_CMD}*100";;
    "UP")
        sndioctl output.level=+${ARG[2]};;
    "DOWN")
        sndioctl output.level=-${ARG[2]};;
    "TOGMUTE")
        sndioctl output.mute=!
        notify-send "Volume Muted";;
esac
#+end_src

** sndiovolv2.sh.template
#+begin_src sh :tangle-mode (identity #o755)  :tangle sndiovolv2.sh.template
#!/usr/local/bin/bash

VOL_CMD=$(sndioctl output.level | cut -d'=' -f2)
ARG[1]=$1
if [ ! -z $2 ]; then
    ARG[2]=$(bc -l <<< "$2/100" | xargs printf %.2f)
fi

case ${ARG[1]} in
    "UP")
        sndioctl output.level=+${ARG[2]};;
    "DOWN")
        sndioctl output.level=-${ARG[2]};;
    "TOGMUTE")
        if [ -f "/tmp/prev_vol" ]; then
            PREV_VOL=$(cat /tmp/prev_vol)
        else
            PREV_VOL=$(echo ${VOL_CMD} > /tmp/prev_vol)
        fi
        IS_MUTED=$(bc -l <<< "${PREV_VOL}>0")
        if [ ! ${IS_MUTED} ]; then
            sndioctl output.level=${PREV_VOL}
        else
            sndioctl output.level=0.000
        fi
esac
#+end_src

* Wayland scripts
Scripts for Wayland.
