src/guix-config/binaries/bin/binaries.html

<div id="outline-container-orgc019f07" class="outline-3">
<h3 id="orgc019f07"><span class="section-number-3">6.13.</span> start-keychain</h3>
<div class="outline-text-3" id="text-6-13">
<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh

eval $(keychain --eval --noask --quiet id_ed25519)
</pre>
</div>
</div>
</div>

<div id="outline-container-org5b43d00" class="outline-3">
<h3 id="org5b43d00"><span class="section-number-3">6.14.</span> rain-sounds.sh</h3>
<div class="outline-text-3" id="text-6-14">
<div class="org-src-container">
<pre class="src src-sh">#!/bin/bash

chromium --new-window https://www.youtube.com/watch?v=SEkPsIXQEIU &amp;


qpwgraph -a $HOME/Documents/qpwgraph-patchbays/dual-output-rain-sounds.qpwgraph &amp;
pavucontrol &amp;

</pre>
</div>
</div>
</div>

<div id="outline-container-org5510518" class="outline-3">
<h3 id="org5510518"><span class="section-number-3">6.15.</span> import-settings</h3>
<div class="outline-text-3" id="text-6-15">
<p>
Set cursor theme e.g for use with Hyprland or any other window manager that runs on Wayland.
</p>
<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh

# usage: import-gsettings
config="${XDG_CONFIG_HOME:-$HOME/.config}/gtk-3.0/settings.ini"
if [ ! -f "$config" ]; then exit 1; fi

gnome_schema="org.gnome.desktop.interface"
gtk_theme="$(grep 'gtk-theme-name' "$config" | sed 's/.*\s*=\s*//')"
icon_theme="$(grep 'gtk-icon-theme-name' "$config" | sed 's/.*\s*=\s*//')"
cursor_theme="$(grep 'gtk-cursor-theme-name' "$config" | sed 's/.*\s*=\s*//')"
font_name="$(grep 'gtk-font-name' "$config" | sed 's/.*\s*=\s*//')"
gsettings set "$gnome_schema" gtk-theme "$gtk_theme"
gsettings set "$gnome_schema" icon-theme "$icon_theme"
gsettings set "$gnome_schema" cursor-theme "$cursor_theme"
gsettings set "$gnome_schema" font-name "$font_name"
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6b3ac73" class="outline-2">
<h2 id="org6b3ac73"><span class="section-number-2">7.</span> Music control scripts</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgc295936" class="outline-3">
<h3 id="orgc295936"><span class="section-number-3">7.1.</span> mpc-control.sh</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh
#

PAUSECMD=$(mpc | egrep '(paused|playing)' | awk '{print $1}' | sed 's/\[//g;s/\]//g')
ARG="$1"

case "$ARG" in
    "PAUSE" )
	echo "${PAUSECMD}" &gt; /tmp/mpcpausedstate
	if [[ "$(cat /tmp/mpcpausedstate)" == "paused" ]]; then
	    mpc play
	fi
	if [[ "$(cat /tmp/mpcpausedstate)" == "playing" ]]; then
	    mpc pause
	fi
	;;
    "STOP" )
	mpc stop
	;;
    "NEXT" )
	mpc next
	;;
    "PREVIOUS" )
	mpc prev
	;;
    "STATUS" )
	mpc | head -n2 | tr '\n' ' '
	;;
esac
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org387a3e3" class="outline-2">
<h2 id="org387a3e3"><span class="section-number-2">8.</span> Status bar scripts</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org427b8bc" class="outline-3">
<h3 id="org427b8bc"><span class="section-number-3">8.1.</span> launch-bar.sh</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh

oxbar -F $HOME/.config/oxbar/oxbar.conf mytheme
</pre>
</div>
</div>
</div>

<div id="outline-container-org00e5558" class="outline-3">
<h3 id="org00e5558"><span class="section-number-3">8.2.</span> launchdzenbar.sh</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh

dzen2script.sh
sleep 1
dzen2script-msgs.sh
sleep 1
dzen2script-volbar.sh
# sleep 1
# dzen2script-weather.sh &amp;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdc4518a" class="outline-2">
<h2 id="orgdc4518a"><span class="section-number-2">9.</span> Volume control scripts</h2>
<div class="outline-text-2" id="text-9">
<p>
Scripts to control volume.
</p>
</div>
<div id="outline-container-orgd7c532e" class="outline-3">
<h3 id="orgd7c532e"><span class="section-number-3">9.1.</span> dbar-volume.sh</h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh

VOLUME="$(sndiovolv2.sh STATUS | xargs printf %.0f)"

echo ${VOLUME} | dbar -max 100 -min 0 -s '#' -l 'Vol'
</pre>
</div>
</div>
</div>

<div id="outline-container-org48f5add" class="outline-3">
<h3 id="org48f5add"><span class="section-number-3">9.2.</span> sndiovol.sh</h3>
<div class="outline-text-3" id="text-9-2">
<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh

VOLCMD=$(sndioctl | grep output.level | sed 's/output\.level\=//g')
VOL=$(echo "${VOLCMD}*100" | bc)
ADJ="$1"
VOLADJ="$2"

if [[ -z $VOLADJ ]]; then
    UP=3
    DOWN=3
else
    UP=$VOLADJ
    DOWN=$VOLADJ
fi

VOLUP=$(echo "(${VOL}+$UP)/100" | bc -l)
VOLDOWN=$(echo "(${VOL}-$DOWN)/100" | bc -l)

if [[ "$ADJ" == "UP" ]]; then
    sndioctl output.level=+${VOLUP}
fi

if [[ "$ADJ" == "DOWN" ]]; then
    sndioctl output.level=-${VOLDOWN}
fi

if [[ "$ADJ" == "STATUS" ]]; then
    echo "${VOL}"
fi

MUTESTATUS=$(echo "(${VOL}/100)&gt;0" | bc -l)

if [[ "$ADJ" == "TOGMUTE" ]]; then
    if [[ ${MUTESTATUS} -eq 1 ]]; then
	CURVOL=$(echo $(echo "${VOL}/100" | bc -l) &gt; /tmp/curvol)
	sndioctl output.level=0
    fi
    if [[ ${MUTESTATUS} -eq 0 ]]; then
	CURVOL=$(cat /tmp/curvol)
	sndioctl output.level=${CURVOL}
    fi
fi
</pre>
</div>
</div>
</div>

<div id="outline-container-org6e7b81c" class="outline-3">
<h3 id="org6e7b81c"><span class="section-number-3">9.3.</span> sndiovolv2.sh</h3>
<div class="outline-text-3" id="text-9-3">
<div class="org-src-container">
<pre class="src src-sh">#!/usr/local/bin/bash

VOL_CMD=$(sndioctl output.level | cut -d'=' -f2)
ARG[1]=$1
if [ ! -z $2 ]; then
    ARG[2]=$(bc -l &lt;&lt;&lt; "$2/100" | xargs printf %.2f)
fi

case ${ARG[1]} in
    "STATUS")
	bc -l &lt;&lt;&lt; "${VOL_CMD}*100";;
    "UP")
	sndioctl output.level=+${ARG[2]};;
    "DOWN")
	sndioctl output.level=-${ARG[2]};;
    "TOGMUTE")
	sndioctl output.mute=!
	notify-send "Volume Muted";;
esac
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbba8126" class="outline-3">
<h3 id="orgbba8126"><span class="section-number-3">9.4.</span> sndiovolv2.sh.template</h3>
<div class="outline-text-3" id="text-9-4">
<div class="org-src-container">
<pre class="src src-sh">#!/usr/local/bin/bash

VOL_CMD=$(sndioctl output.level | cut -d'=' -f2)
ARG[1]=$1
if [ ! -z $2 ]; then
    ARG[2]=$(bc -l &lt;&lt;&lt; "$2/100" | xargs printf %.2f)
fi

case ${ARG[1]} in
    "UP")
	sndioctl output.level=+${ARG[2]};;
    "DOWN")
	sndioctl output.level=-${ARG[2]};;
    "TOGMUTE")
	if [ -f "/tmp/prev_vol" ]; then
	    PREV_VOL=$(cat /tmp/prev_vol)
	else
	    PREV_VOL=$(echo ${VOL_CMD} &gt; /tmp/prev_vol)
	fi
	IS_MUTED=$(bc -l &lt;&lt;&lt; "${PREV_VOL}&gt;0")
	if [ ! ${IS_MUTED} ]; then
	    sndioctl output.level=${PREV_VOL}
	else
	    sndioctl output.level=0.000
	fi
esac
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbb1c293" class="outline-2">
<h2 id="orgbb1c293"><span class="section-number-2">10.</span> Wayland scripts</h2>
<div class="outline-text-2" id="text-10">
<p>
Scripts for Wayland.
</p>
</div>
